In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("/Users/amayjain/Documents/Portfolio/Pinball/Data/region_location_machine_counts.csv")

In [3]:
df = df.drop('Unnamed: 0', axis = 1)

In [4]:
sum(df["#_locations"]), sum(df["#_machines"])

(7149, 28182)

In [5]:
df

       regions  #_locations  #_machines
0     sandiego           86         196
1     cheyenne           10          45
2      wichita           23          83
3      memphis            8          36
4     montreal           35         116
..         ...          ...         ...
93     bayarea          215         706
94          uk          110         447
95  pittsburgh          122         985
96    delaware           25         149
97     finland           91         516

[98 rows x 3 columns]